# 1. Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.

a, b, c = input('Введите трехзначное число: ')
print('Сумма чисел равна: ', (int(a) + int(b) + int(c)))
print('Произведение чисел равно: ', (int(a) * int(b) * int(c)))
