# 6. Пользователь вводит номер буквы в алфавите. Определить, какая это буква

alphabet = 'abcdefghijklmnopqrstuvwxyz'
a = int(input())
print(alphabet[a])
